<!DOCTYPE html>
<html lang="kr">
<head>
	<title>학생들이 어떻게 됐냐?</title>
	<link href="./css/bootstrap.min.css" rel="stylesheet" type="text/css">
	<?php require "footer.php"; ?>
	<script src="./dev/js/popper.min.js"></script>
	</head>
<section>
	<div class="container">
<?php
  $link = mysqli_connect('localhost', 'root', 'qudwnWkd321!@#');
  if (!$link) { die('연결에 실패했습니다: ' . mysqli_error());}
  // echo 'MySQL 서버에 정상적으로 연결되었습니다.';

// 학번들
$ids = array("201601045", "201602014", "201603030", "201603051", "201603057", "201802031", "201803030", "201901001", "201901002", "201901003", "201901004", "201901005", "201901006", "201901007", "201901008", "201901009", "201901010", "201901011", "201901012", "201901013", "201901014", "201901015", "201901016", "201901017", "201901018", "201901019", "201901020", "201901021", "201901022", "201901023", "201901024", "201901025", "201901026", "201901027", "201901028", "201901029", "201901030", "201901031", "201901032", "201901033", "201901034", "201901035", "201901036", "201901037", "201901038", "201901039", "201901040", "201901041", "201901042", "201901043", "201901044", "201901045", "201901046", "201901047", "201901048", "201901050", "201901051", "201901052", "201901053", "201901054", "201902001", "201902002", "201902003", "201902004", "201902005", "201902006", "201902007", "201902008", "201902009", "201902010", "201902011", "201902012", "201902013", "201902014", "201902015", "201902016", "201902017", "201902019", "201902020", "201902021", "201902023", "201902024", "201902025", "201902026", "201902027", "201902028", "201902029", "201902030", "201902031", "201902032", "201902033", "201902034", "201902035", "201902036", "201902037", "201902038", "201902039", "201902040", "201902041", "201902042", "201902043", "201902044", "201902045", "201902046", "201902047", "201902048", "201902049", "201902050", "201902051", "201902052", "201902053", "201903001", "201903002", "201903004", "201903005", "201903007", "201903008", "201903009", "201903010", "201903011", "201903012", "201903013", "201903015", "201903016", "201903017", "201903018", "201903019", "201903020", "201903022", "201903023", "201903024", "201903025", "201903026", "201903027", "201903028", "201903029", "201903030", "201903032", "201903033", "201903034", "201903035", "201903037", "201903038", "201903039", "201903041", "201903042", "201903043", "201903044", "201903045", "201903046", "201903048", "201903049", "201903050", "201903051", "201903052", "201903053");
$ds = array("201601045", "201602014", "201603030", "201603051", "201603057", "201802031", "201803030", "201901001", "201901002", "201901003", "201901004", "201901005", "201901006", "201901007", "201901008", "201901009", "201901010", "201901011", "201901012", "201901013", "201901014", "201901015", "201901016", "201901017", "201901018", "201901019", "201901020", "201901021", "201901022", "201901023", "201901024", "201901025", "201901026", "201901027", "201901028", "201901029", "201901030", "201901031", "201901032", "201901033", "201901034", "201901035", "201901036", "201901037", "201901038", "201901039", "201901040", "201901041", "201901042", "201901043", "201901044", "201901045", "201901046", "201901047", "201901048", "201901050", "201901051", "201901052", "201901053", "201901054", "201902001", "201902002", "201902003", "201902004", "201902005", "201902006", "201902007", "201902008", "201902009", "201902010", "201902011", "201902012", "201902013", "201902014", "201902015", "201902016", "201902017", "201902019", "201902020", "201902021", "201902023", "201902024", "201902025", "201902026", "201902027", "201902028", "201902029", "201902030", "201902031", "201902032", "201902033", "201902034", "201902035", "201902036", "201902037", "201902038", "201902039", "201902040", "201902041", "201902042", "201902043", "201902044", "201902045", "201902046", "201902047", "201902048", "201902049", "201902050", "201902051", "201902052", "201902053", "201903001", "201903002", "201903004", "201903005", "201903007", "201903008", "201903009", "201903010", "201903011", "201903012", "201903013", "201903015", "201903016", "201903017", "201903018", "201903019", "201903020", "201903022", "201903023", "201903024", "201903025", "201903026", "201903027", "201903028", "201903029", "201903030", "201903032", "201903033", "201903034", "201903035", "201903037", "201903038", "201903039", "201903041", "201903042", "201903043", "201903044", "201903045", "201903046", "201903048", "201903049", "201903050", "201903051", "201903052", "201903053");

$i = 0;
$rai = 0;
mysqli_select_db($link, "wordpress");
$q = "select ID,user_email from nagehts_users";
$qr = mysqli_query($link, $q);
echo("<div class=\"row\"><div class=\"col text-center display-1\">[ 조회 ]</div></div>");

// 등록학생
echo("<div class=\"row\"><div class=\"col text-start\"> 문의는 <a href=\"mailto:cansmile@gmail.com\">cansmile@gmail.com</a>로 이메일하시면 답변드립니다.<br><span class=\"bg-danger text-white\">청강이신 분</span>도 이메일 주시면 교수님께 확인하여서 승급하여 드립니다.) </div></div>");
// echo("<div class=\"row\"><div class=\"col text-start\"><span class=\"bg-success text-white\">초록색 배경</span>이 아니신 분은 학번을 정정해 주세요.<br><span class=\"bg-info text-white\">학번이 2개</span>(계정이 2개) 이신분은 <a href=\"mailto:cansmile@gmail.com\">cansmile@gmail.com</a>로 사용하실 계정을 보내주세요.<br><span class=\"bg-danger text-white\">청강이신 분</span>도 이메일 주시면 교수님께 확인하여서 승급하여 드립니다.) </div></div>");

$qnr = mysqli_num_rows($qr); // 읽어온 nagehts_users 갯수
for($a = 0; $a < $qnr; $a++) {
	$al = "";
	$stid = $usrid = $em = "";

	// 1차 쿼리 준비
	$r = mysqli_fetch_array($qr);
	$al = ($a+1)." | ";
	$rn = count($r);
	$em = $r[1];
	$usrid = $r[0];
	// 1차 쿼리 출력
	for($b = 0; $b < $rn; $b++) {
		$al .= $r[$b];
		if((count($rn)-1) < ($b + 1)) {
			$al .= " | ";
		}
	}

	// 2차 쿼리 준비
	$sq = "select meta_key,meta_value from nagehts_usermeta where user_id=".$r[0];
	$sqr = mysqli_query($link, $sq);
	$sqnr = mysqli_num_rows($sqr); // 읽어온 nagehts_users 갯수

	// 2차 쿼리 출력
	for($z = 0; $z < $qnr; $z++) {
		$sr = mysqli_fetch_array($sqr);
		$srn = count($sr);
		if($sr[0] == "student_id") {
			$stid = $sr[1];
			$al .= $sr[1];
			$al .= " | ";
			if(substr($sr[1],0,3) != "201") {
				$f1 = 1;
			}
		}

		if($sr[0] == "nagehts_user_level") {
			$al .= $sr[1];
			$al .= " | ";
			if($sr[1] == 7) {
				$a1 = " text-weight-bold";
			}
			$uslv = $sr[1];
		}

	}
	if(!$f1) {
		// $a2 = " text-white bg-success";
	}
		// echo("<div class=\"border border-success col".$a1.$a2.$a3."\">");
		// echo($al);
		// echo("</div>");
		$re[$a] = array("studentid" => $stid, "userid" => $usrid, "email" => $em, "userlevel" => $uslv);
		$a1 = $a2 = $f1 = "";
}

function arr_sort($array, $key, $sort='asc') //정렬대상 array, 정렬 기준 key, 오름/내림차순
{
 $keys = array();
 $vals = array();

 foreach ($array as $k=>$v)
 {
  $i = $v[$key].'.'.$k;
  $vals[$i] = $v;
  array_push($keys, $k);
 }
 unset($array);

 if ($sort=='asc') {
  ksort($vals);
 } else {
  krsort($vals);
 }

 $ret = array_combine($keys, $vals);
 unset($keys);
 unset($vals);
 return $ret;
}

// $ra = arr_sort($re,'userid');
$ra = arr_sort($re,'studentid');
// print_r($ra);
echo("<table class=\"table\"><thead><tr><th scope=\"col\">입력된 학번</th><th scope=\"col\">이메일</th><th scope=\"col\">비고</th></tr></thead><tbody>");
// echo("<table class=\"table\"><thead><tr><th scope=\"col\">입력된 학번</th><th scope=\"col\">이메일</th><th scope=\"col\">사용자 번호</th><th scope=\"col\">비고</th></tr></thead><tbody>");
$prv = $rep = $rem = "";
for($i = 0; $i < $qnr; $i++) {
	if($prv != "") {
		// $a4 = " bg-success text-white";
	} else {
		$a4 = "";
	}
	$prv = "";
	if(in_array($ra[$i]["studentid"],$ds)) {
		if(in_array($ra[$i]["studentid"],$ids)) {
			$f2 = 1;
		} else {
			$f2 = 0;
		}
		$c1 = "O";
	} else {
		$c1 = "X";
		$a4 = "";
	}

	if($ra[$i]["userid"] > 6) {
		echo("<tr><th scope=\"row\" class=\"".$a4."\">".$ra[$i]["studentid"]."</th><td class=\"".$a4."\">".$ra[$i]["email"]."</td><td class=\"".$a4.$a5."\">");
		// echo("<tr><th scope=\"row\" class=\"".$a4."\">".$ra[$i]["studentid"]."</th><td class=\"".$a4."\">".$ra[$i]["email"]."</td><td class=\"".$a4."\">".$ra[$i]["userid"]."</td><td class=\"".$a4.$a5."\">");
		if($c1 == "O") {
			if($f2) {
				echo("승급 됨");
				$rai++;
			} else {
				echo("처리 대상");
			}
		} else if($c1 == "X") {
			if(strlen($ra[$i]["studentid"]) < 9) {
				echo("학번 정정 필요");
			} else {
				echo("수강생 아님");
			}
		}
		echo("</td></tr>\n");
	}

	if($ra[$i]["userlevel"] == 0) {
		if(strlen($ra[$i]["studentid"]) > 8) {
			$rep .= $ra[$i]["studentid"]."\n";
		} else {
			$rem .= $ra[$i]["email"]."\n";
		}
	}
	$prv = $ra[$i]["studentid"];
}
echo("</tbody></table>");

// 미등록 학생
echo("<div class=\"row\"><div class=\"col text-center display-4\">수강등록생 중 미등록 학번</div></div>");
$stn = $stnr = "";
for($i = 0; $i < count($ids); $i++) {
	// 1차 쿼리
	$q = "SELECT user_id from nagehts_usermeta where meta_value = ".$ids[$i];
	$qr = mysqli_query($link, $q);
	$r = mysqli_fetch_array($qr);
	$stn = $ids[$i];
	// 2차 쿼리 준비
	if($r[0] == "") {
		if($stnr != "") {
			$stnr .= ", ";
		}
		$stnr .= $stn;
	}
}
echo("<div class=\"text-danger text-weight-bold\">".$stnr."</div>");


echo("<br>출석부 등록 학생: ".count($ds)."명, 승급된 학생: ".$rai."명");
?>
	</div>
</section>
</body>
</html>
